Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor(Autodesk.Revit.DB.Solid,System.Boolean)
Constructs a filter to match elements which intersect the given element, with the
option to match all elements not intersecting the given element.
solid:
The solid geometry to check for intersection.
inverted:
True if the filter should match all elements which do not intersect the given
element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor(Autodesk.Revit.DB.Solid)
Constructs a filter to match elements which intersect the given element.
solid:
The solid geometry to check for intersection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012